src/cf/Documents/CRM_Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_Взаимодействие</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Баллы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияВзаимодействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_Интерес</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Телемаркетинг</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяВыручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальныйКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИнтереса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершение</Name>
					<Comment>Используется только в календаре, для управления длительностью взаимодействия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершившийПользователь</Name>
					<Comment>Завершивший пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/CRM_Взаимодействие/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		ЭтотОбъект.ДокументОснование	= ДанныеЗаполнения.Ссылка;
		ЭтотОбъект.КонтактноеЛицо		= ДанныеЗаполнения.КонтактноеЛицо;
		ЭтотОбъект.ОжидаемаяВыручка		= ДанныеЗаполнения.ОжидаемаяВыручка;
		ЭтотОбъект.Ответственный		= ДанныеЗаполнения.Ответственный;
		ЭтотОбъект.Партнер				= ДанныеЗаполнения.Партнер;
		ЭтотОбъект.Подразделение		= ДанныеЗаполнения.Подразделение;
		ЭтотОбъект.ПотенциальныйКлиент	= ДанныеЗаполнения.ПотенциальныйКлиент;
		ЭтотОбъект.Организация			= ДанныеЗаполнения.Организация;
	КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ДокументОснование.Пустая() И ВидВзаимодействия <> Справочники.CRM_СостоянияСобытий.Отменено Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ТекстОшибки = "";
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес")
			И ЗначениеЗаполнено(ДокументОснование.ПотенциальныйКлиент) 
			И ДокументОснование.ПотенциальныйКлиент <> ПотенциальныйКлиент Тогда
			ТекстОшибки = ТекстОшибки + "Не совпадает значение потенциального клиента с документом-основанием";
			Отказ = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОснование) 
			И ОбщегоНазначения.ЕстьРеквизитОбъекта("Партнер", ДокументОснование.Метаданные()) 
			И ЗначениеЗаполнено(ДокументОснование.Партнер) 
			И ДокументОснование.Партнер <> Партнер 
			// Дополнительная проверка при конвертации событий
			И (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CRM_Телемаркетинг") 
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") И НЕ (СтрНайти(ДокументОснование.Описание, НСтр("ru = ' [Конвертирован из '")))) Тогда
			
			ТекстОшибки = ТекстОшибки + "Не совпадает Клиент";
			Отказ = Истина;
		КонецЕсли;
		
		Если ВидВзаимодействия <> Справочники.CRM_ВидыВзаимодействий.ПотеряОбращения И НЕ ЗначениеЗаполнено(Содержание) Тогда
			ТекстОшибки = ТекстОшибки + "Не заполнено содержание взаимодействия";
			Отказ = Истина;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВидВзаимодействия) Тогда
			ТекстОшибки = ТекстОшибки + "Не заполнен вид взаимодействия";
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ И Не ПустаяСтрока(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		МетаданныеДокументаОснования = ДокументОснование.Метаданные();
		
		Если НЕ ЗначениеЗаполнено(КонтактноеЛицо)
			И CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("КонтактноеЛицо", МетаданныеДокументаОснования)
			Тогда
			КонтактноеЛицо = ДокументОснование.КонтактноеЛицо;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Партнер) И НЕ ЗначениеЗаполнено(ПотенциальныйКлиент) И ТипЗнч(ДокументОснование) <> Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
			Партнер = ДокументОснование.Партнер;
			Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("ПотенциальныйКлиент", МетаданныеДокументаОснования) Тогда
				ПотенциальныйКлиент = ДокументОснование.ПотенциальныйКлиент;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПлановаяДатаЗавершение) ИЛИ
			ПлановаяДатаЗавершение < ПлановаяДата Тогда
			ПлановаяДатаЗавершение = ПлановаяДата + 60*15;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
